vertical-pod-autoscaler/experiments/sn-pbr-throughput/1plus/compose.log
Running 15m test @ http://10.100.147.32:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 19.512ms, rate sampling interval: 52ms
  Thread calibration: mean lat.: 19.313ms, rate sampling interval: 52ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.28m     2.17m    8.03m    85.42%
    Req/Sec     3.32      8.16    38.00     84.45%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.30s 
 75.000%    1.04m 
 90.000%    5.09m 
 99.000%    8.03m 
 99.900%    8.23m 
 99.990%    8.32m 
 99.999%    8.34m 
100.000%    8.34m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       9.527     0.000000            1         1.00
     755.711     0.100000          597         1.11
    3545.087     0.200000         1194         1.25
    6578.175     0.300000         1789         1.43
   10878.975     0.400000         2385         1.67
   15302.655     0.500000         2981         2.00
   18497.535     0.550000         3279         2.22
   27475.967     0.600000         3577         2.50
   35651.583     0.650000         3875         2.86
   51511.295     0.700000         4173         3.33
   62259.199     0.750000         4473         4.00
   65994.751     0.775000         4621         4.44
   99155.967     0.800000         4769         5.00
  147324.927     0.825000         4918         5.71
  201981.951     0.850000         5067         6.67
  240123.903     0.875000         5216         8.00
  270270.463     0.887500         5291         8.89
  305397.759     0.900000         5365        10.00
  328466.431     0.912500         5440        11.43
  369885.183     0.925000         5514        13.33
  409731.071     0.937500         5589        16.00
  421003.263     0.943750         5627        17.78
  440139.775     0.950000         5663        20.00
  451674.111     0.956250         5702        22.86
  460324.863     0.962500         5739        26.67
  466616.319     0.968750         5778        32.00
  469499.903     0.971875         5795        35.56
  471334.911     0.975000         5812        40.00
  474742.783     0.978125         5832        45.71
  477888.511     0.981250         5852        53.33
  479199.231     0.984375         5870        64.00
  479985.663     0.985938         5880        71.11
  481034.239     0.987500         5888        80.00
  481558.527     0.989062         5897        91.43
  483393.535     0.990625         5907       106.67
  486014.975     0.992188         5916       128.00
  487063.551     0.992969         5921       142.22
  487587.839     0.993750         5924       160.00
  488374.271     0.994531         5930       182.86
  489160.703     0.995313         5935       213.33
  489422.847     0.996094         5938       256.00
  489947.135     0.996484         5941       284.44
  490209.279     0.996875         5943       320.00
  491257.855     0.997266         5946       365.71
  491519.999     0.997656         5949       426.67
  491782.143     0.998047         5951       512.00
  491782.143     0.998242         5951       568.89
  492044.287     0.998437         5952       640.00
  492306.431     0.998633         5953       731.43
  493617.151     0.998828         5955       853.33
  493879.295     0.999023         5956      1024.00
  493879.295     0.999121         5956      1137.78
  497287.167     0.999219         5957      1280.00
  497287.167     0.999316         5957      1462.86
  498073.599     0.999414         5958      1706.67
  499122.175     0.999512         5959      2048.00
  499122.175     0.999561         5959      2275.56
  499122.175     0.999609         5959      2560.00
  499122.175     0.999658         5959      2925.71
  499384.319     0.999707         5960      3413.33
  499384.319     0.999756         5960      4096.00
  499384.319     0.999780         5960      4551.11
  499384.319     0.999805         5960      5120.00
  499384.319     0.999829         5960      5851.43
  500170.751     0.999854         5961      6826.67
  500170.751     1.000000         5961          inf
#[Mean    =    76859.189, StdDeviation   =   130259.837]
#[Max     =   499908.608, Total count    =         5961]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6079 requests in 15.00m, 1.25MB read
  Socket errors: connect 0, read 0, write 5, timeout 538
Requests/sec:      6.75
Transfer/sec:      1.42KB